/*********************************
 * OrMonitor 定时器
 * itimer.h
*********************************/

#ifndef __ITIMER_H__
#define __ITIMER_H__


/*********************************
 * 定值
*********************************/
#define FIRST_TIME_SEC     (0)  // 首次启动等待时间 (s)
#define FIRST_TIME_MSEC    (1)  // 首次启动等待时间 (ms)

/*********************************
 * 变量
*********************************/


/*********************************
 * 函数
*********************************/
BOOL itimer_start(int msec);
BOOL itimer_stop();

#endif // __ITIMER_H__

