/*********************************
 * OrMonitor 工具
 * utility.h
*********************************/

#ifndef __UTILITY_H__
#define __UTILITY_H__


/*********************************
 * 定值
*********************************/
#define u_int   unsigned int

#define BOOL    int
#define TRUE    (1)
#define FALSE   (0) 

/*********************************
 * 变量
*********************************/


/*********************************
 * 函数
*********************************/
// utility.c
int gcd(int lhs, int rhs);


#endif // __UTILITY_H__

